rewrote the issue to have a working exemple when I downgrade.
Here is the the working configuration with a 5.38 provider:
```
terraform {
  backend "local" {}
  required_providers {
    github = {
      source  = "integrations/github"
      version = "5.38"
    }
  }
}
provider "github" {
  owner = "saez0pub"
}
resource "github_actions_environment_secret" "withencoding" {
  repository       = "github_secret"
  environment       = "need%2Fencoding"
  secret_name       = "foo"
  plaintext_value   = "bar"
}
resource "github_actions_environment_secret" "withoutencoding" {
  repository       = "github_secret"
  environment       = "noencoding"
  secret_name       = "foo"
  plaintext_value   = "bar"
}
```

And the output is OK
```
terraform apply
github_actions_environment_secret.withoutencoding: Refreshing state... [id=github_secret:noencoding:foo]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_environment_secret.withencoding will be created
  + resource "github_actions_environment_secret" "withencoding" {
      + created_at      = (known after apply)
      + environment     = "need%2Fencoding"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "github_secret"
      + secret_name     = "foo"
      + updated_at      = (known after apply)
    }

  # github_actions_environment_secret.withoutencoding will be created
  + resource "github_actions_environment_secret" "withoutencoding" {
      + created_at      = (known after apply)
      + environment     = "noencoding"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "github_secret"
      + secret_name     = "foo"
      + updated_at      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

github_actions_environment_secret.withoutencoding: Creating...
github_actions_environment_secret.withencoding: Creating...
github_actions_environment_secret.withoutencoding: Creation complete after 3s [id=github_secret:noencoding:foo]
github_actions_environment_secret.withencoding: Creation complete after 5s [id=github_secret:need%2Fencoding:foo]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```